app/models/quote.rb

SELECT "quotes".* FROM "quotes"
---
  def self.singleQuote
    quote_array = Quote.all

    random_quote = quote_array[rand(quote_array.length)]